-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Sep 28, 2025 at 11:39 AM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `flauntfin`
--
CREATE DATABASE IF NOT EXISTS `flauntfin` DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci;
USE `flauntfin`;

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `categories_id` int(11) NOT NULL,
  `categories_name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`categories_id`, `categories_name`) VALUES
(1, 'Hoodie'),
(2, 't-shirt'),
(3, 'shorts'),
(4, 'trousers'),
(5, 'Dress'),
(6, 'pajamas');

-- --------------------------------------------------------

--
-- Table structure for table `orders`
--

CREATE TABLE `orders` (
  `orders_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `order_data` varchar(255) NOT NULL,
  `shipping_name` varchar(255) DEFAULT NULL,
  `shipping_phone` varchar(50) DEFAULT NULL,
  `shipping_address` text DEFAULT NULL,
  `total_amount` decimal(10,2) NOT NULL,
  `created` int(11) NOT NULL,
  `status` varchar(50) NOT NULL DEFAULT 'pending',
  `tracking_number` varchar(255) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `orders`
--

INSERT INTO `orders` (`orders_id`, `user_id`, `order_data`, `shipping_name`, `shipping_phone`, `shipping_address`, `total_amount`, `created`, `status`, `tracking_number`, `created_at`) VALUES
(1, 1, '[{\"product_id\":26,\"quantity\":1,\"price\":170,\"cart_key\":\"26_29\"}]', 'ทอฝัน', '0999999999', 'ร้อย้อ็ด', 170.00, 1758952511, 'pending', NULL, '2025-09-27 06:30:36'),
(2, 1, '[{\"product_id\":33,\"quantity\":1,\"price\":149,\"cart_key\":\"33_49\"}]', 'บอมอ', '0888888888', 'มหาสารคาม', 149.00, 1758952693, 'pending', NULL, '2025-09-27 06:30:36'),
(3, 1, '[{\"product_id\":27,\"quantity\":1,\"price\":100,\"cart_key\":\"27_32\"},{\"product_id\":41,\"quantity\":1,\"price\":399,\"cart_key\":\"41_71\"}]', 'พรีม', '0777777777', 'กาฬสินธ์', 499.00, 1758953722, 'pending', NULL, '2025-09-27 06:30:36'),
(4, 1, '[{\"product_id\":40,\"quantity\":1,\"price\":279,\"cart_key\":\"40_67\"}]', 'ปอ', '0666666666', 'อุดรธานี', 279.00, 1758955623, 'pending', NULL, '2025-09-27 06:47:03'),
(5, 1, '[{\"product_id\":26,\"quantity\":1,\"price\":170,\"cart_key\":\"26_30\"}]', 'โบว์', '0555555555', 'ขอนแก่น', 170.00, 1758959851, 'pending', NULL, '2025-09-27 07:57:31'),
(6, 1, '[{\"product_id\":51,\"quantity\":1,\"price\":379,\"cart_key\":\"51_93\"}]', 'หม่อนไหม', '0900000000', 'บุรีรัมย์', 379.00, 1758963362, 'pending', NULL, '2025-09-27 08:56:02'),
(7, 10, '[{\"product_id\":35,\"quantity\":1,\"price\":79,\"cart_key\":\"35_55\"},{\"product_id\":27,\"quantity\":1,\"price\":100,\"cart_key\":\"27_32\"},{\"product_id\":31,\"quantity\":1,\"price\":299,\"cart_key\":\"31_43\"}]', 'หม่อนไหม', '0900000000', 'บุรีรัมย์', 478.00, 1758964046, 'pending', NULL, '2025-09-27 09:07:26'),
(8, 1, '[{\"product_id\":27,\"quantity\":1,\"price\":100,\"cart_key\":\"27_32\"}]', 'ปป', '000', 'เ้่', 100.00, 1759044907, 'pending', NULL, '2025-09-28 07:35:07');

-- --------------------------------------------------------

--
-- Table structure for table `order_items`
--

CREATE TABLE `order_items` (
  `order_items_id` int(11) NOT NULL,
  `order_id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `quantity` int(11) NOT NULL,
  `price` decimal(10,2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `order_items`
--

INSERT INTO `order_items` (`order_items_id`, `order_id`, `product_id`, `quantity`, `price`) VALUES
(1, 1, 26, 1, 170.00),
(2, 2, 33, 1, 149.00),
(3, 3, 27, 1, 100.00),
(4, 3, 41, 1, 399.00),
(5, 4, 40, 1, 279.00),
(6, 5, 26, 1, 170.00),
(7, 6, 51, 1, 379.00),
(8, 7, 35, 1, 79.00),
(9, 7, 27, 1, 100.00),
(10, 7, 31, 1, 299.00),
(11, 8, 27, 1, 100.00);

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `product_id` int(11) NOT NULL,
  `product_name` varchar(255) NOT NULL,
  `description` text NOT NULL,
  `price` decimal(10,0) NOT NULL,
  `image_url` longblob NOT NULL,
  `status` varchar(255) NOT NULL,
  `created_at` date NOT NULL,
  `category` varchar(255) NOT NULL,
  `additional_details` varchar(300) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`product_id`, `product_name`, `description`, `price`, `image_url`, `status`, `created_at`, `category`, `additional_details`) VALUES
(26, 'เสื้อฮู้ด สกรีนอก มีกระเป๋าล้วงด้านหน้า GATKE', 'เสื้อฮู้ด สกรีนอก GATKE ผ้าสำลีหนานุ่ม เสื้อกันหนาว เสื้อแขนยาว ฮู้ด Man Clothing เสื้อกันหนาวชาย', 170, 0x696d616765732f363864323830326362363166615f31202831292e6a7067, '', '0000-00-00', 'Hoodie', 'รายละเอียดสินค้า\r\nเสื้อฮู้ด สกรีนอก GATKE ผ้าสำลีหนานุ่ม เสื้อกันหนาว เสื้อแขนยาว ฮู้ด Man Clothing เสื้อกันหนาวชาย\r\n- สินค้าพร้อมส่ง มีเก็บเงินปลายทาง \r\n- เสื้อฮู้ตกันหนาวสเวตเตอร์ วินเทจ สกรีนอก GATKE \r\n- ผ้าหนานุ่ม กันหนาวได้ดี  \r\n- มีฮู้ด แบบสวมหัว ใส่ได้ทั้งชายและหญิง \r\n- ผ้าโพลิเอสเตอร์ ด้านใน'),
(27, 'เสื้อยืดแขนสั้น', 'เสื้อยืดแขนสั้น เข้ารูป สีพื้น แฟชั่นฤดูร้อน', 100, 0x696d616765732f363864323831346132376366365f322e312e6a7067, '', '0000-00-00', 't-shirt', 'ความหนา: ปกติ\r\nปีที่ขาย: ฤดูร้อน 2025\r\nสถานการณ์ที่เกี่ยวข้อง: การพักผ่อนอื่นๆ\r\nประเภทปลอกคอ: คอกลม\r\nลายดอกไม้: สีทึบ\r\nความยาวแขนเสื้อ: แขนสั้น\r\nประเภทแบรนด์: ไม่ใช่แบรนด์\r\nสไตล์การแบ่งประเภท: อินเทรนด์\r\nฤดูกาลที่ใช้บังคับ: ฤดูร้อน\r\nขนาดแนะนำ\r\nL 165-170ซม. 50-60กก\r\nXL 170-175ซม. 60-65กก\r\n2XL 175-180'),
(28, 'เสื้อเชิ้ต แขนยาว', 'สีพื้น เอวลอย แฟชั่นฤดูใบไม้ผลิ สําหรับผู้หญิง', 119, 0x696d616765732f363864323932373662373263365f332e6a7067, '', '0000-00-00', 't-shirt', 'ขนาด :\r\nS:ความยาวเสื้อ 21.2 นิ้ว รอบอก 32นิ้ว ไหล่กว้าง 11.5 นิ้ว เเขนยาว 23.6 นิ้ว\r\nM:ความยาวเสื้อ21.6 นิ้ว รอบอก 34 นิ้ว ไหล่กว้าง 13 นิ้ว เเขนยาว 24 นิ้ว\r\nL:ความยาวเสื้อ 22 นิ้ว รอบอก 36 นิ้ว ไหล่กว้าง 14.5 นิ้ว เเขนยาว 24.4 นิ้ว\r\nXL:ความยาวเสื้อ 22.4นิ้ว รอบอก38 นิ้ว ไหล่กว้าง 16 นิ้ว เเขนยาว 24'),
(29, 'เสื้อยืดรัดรูป สาวอวบใส่ได้ ปักโบว์ใหญ่', 'ทรงสวย ใส่แล้วพรางหุ่น เอวคอดสุด แต่งย่นข้าง รุ่น ปักโบว์ใหญ่', 99, 0x696d616765732f363864323933373335353966665f342e6a7067, '', '0000-00-00', 't-shirt', 'รายละเอียดสินค้า\r\n\"เสื้อยืดรัดรูป สาวอวบใส่ได้ ปักโบว์ใหญ่ ทรงสวย ใส่แล้วพรางหุ่น เอวคอดสุด แต่งย่นข้าง สไตล์เกาหลีม้าก รุ่น ปักโบว์ใหญ่\r\nรุ่น ปักโบว์ใหญ่\r\nความยาวเสื้อ 21ความยาวแขน 5\r\nรอบแขนก่อนยืด 8 ยืดสุด 12\r\nอกก่อนยืด 34 ยืดสุด 56'),
(31, 'เสื้อกันUVสตรี', 'ผ้าไหมไอซ์ระบายเหงื่อ กันน้ำ+ป้องกันแดดแรง UPF50+', 299, 0x696d616765732f363864323936313962626132395f372e6a7067, '', '0000-00-00', 't-shirt', ''),
(32, 'เสื้อสายเดี่ยว สไตล์เกาหลี', 'ใส่เป็นเลเยอร์ตัวนอกน่ารักสุดๆ ผ้าเปลือกไม้นุ่มฟู อกถึง-38 นิ้ว (เสื้อโคเรีย)', 119, 0x696d616765732f363864323937663735613039385f382e6a7067, '', '0000-00-00', 't-shirt', 'สายผูกด้านหน้า ใช้งานได้จริง ผูกปรับสายได้ค่ะ\r\nเนื้อผ้าเปลือกไม้ เนื้อดีนุ่มฟู ไม่บางดูสวยเเพงมาก รับประกันงานสวยคุ้มสุดๆๆๆ\r\nฟรีไซส์ \r\nอก : ถึง - 38 นิ้ว\r\nยาว : 27 “\r\nสีตามรูป'),
(33, 'เสื้อยืดโบว์ลูกไม้สไตล์ฝรั่งเศสผู้หญิง Niche คอวีแขนสั้นเสื้อยืดสลิมฟิตสั้นด้านบน BF', 'คอวีแขนสั้นเสื้อยืดสลิมฟิตสั้นด้านบน', 149, 0x696d616765732f363864323938386133393836305f392e6a7067, '', '0000-00-00', 't-shirt', 'เสื้อยืดโบว์ลูกไม้สไตล์ฝรั่งเศสผู้หญิง Niche คอวีแขนสั้นเสื้อยืดสลิมฟิตสั้นด้านบน\r\nคุณสมบัติ\r\nลูกไม้, คอวี, โบว์, ยางยืด, ทรงเข้ารูป, อารมณ์หวาน\r\nการออกแบบที่หรูหรา: เสื้อยืดแขนสั้นนี้มีการออกแบบสีทึบคลาสสิก และการผสมผสานระหว่างลูกไม้และโบว์สะท้อนถึงความรู้สึกเกียจคร้านของสาวฝรั่งเศส คอวีขนาดใหญ่และ'),
(35, 'กางเกงขาสั้นเอวต่ำผ้าย่นใส่สบาย', 'มิกซ์ได้หลายลุค', 79, 0x696d616765732f363864323962323234343939665f31302e6a7067, '', '0000-00-00', 'shorts', 'รายละเอียดสินค้า\r\nกางเกงเอวต่ำผ้าย่น layers ผ้าหนา หรูหรา สไตล์ลูกคุณ ถูกใจสายหวาน สายแซ่บ เท่ห์ๆก็แมทซ์ได้ค่ะ งานผ้านิ่มละมุนสุดๆ รับประกันความสวย ผ้านิ่ม ไม่บาง สำหรับคนกำลังมองหากางเกงใส่นอน ใส่เที่ยวผับได้ ใส่ไปทะเลได้ ใส่ปาร์ตี้ ปาร์ตี้วันเกิด ใส่ถ่ายรูปฟีลลูกคุณ ตัวนี้ตอบโจทย์สาวๆมากๆค่ะ ใส่ได'),
(36, 'กางเกงขาสั้นผ้ายีนส์กระเป๋าธรรมดา', 'แบบลําลองสําหรับผู้หญิง', 239, 0x696d616765732f363864323962633862376537635f31312e6a7067, '', '0000-00-00', 'shorts', 'คำอธิบาย \r\nรูปแบบ: เรียบง่าย\r\nสไตล์ลำลอง\r\nขนาดเพิ่มเติม: ไม่\r\nวัสดุ: วัสดุ: Cotton:\r\nผ้าฝ้าย 70% + โพลีเอสเตอร์ 30% ส่วนประกอบ: ผ้าฝ้าย 70% + โพลีเอสเตอร์ 30%\r\nประเภทพอดี: ทรงพอดีตัว\r\nโปร่งใส: ไม่\r\nการยืด: ยืดปานกลาง\r\nภูมิภาคแหล่งกำเนิด: ประเทศจีน \r\nข้อมูลอ้างอิงขนาด\r\nนางแบบสวมไซซ์: S\r\nส่วนสูง: 165 '),
(37, 'กางเกงกระโปรง เลกกิ้งขาสั้น', 'กางเกงกระโปรง เลกกิ้งขาสั้น เอวสูง ประดับโบว์ แต่งลูกไม้ แฟชั่นฤดูร้อน สไตล์เกาหลี สําหรับสตรี', 129, 0x696d616765732f363864323963346164383837365f31322e6a7067, '', '0000-00-00', 'shorts', 'คุณสมบัติ:\r\n1. ผ้าน้ำหนักเบาให้ความสบายและความทนทานที่เหนือกว่า\r\n2. เหมาะสำหรับการพักผ่อนช้อปปิ้งปาร์ตี้ ฯลฯ\r\n3. ผ้าคุณภาพสูงแฟชั่นลำลอง\r\n4. โอกาสที่เหมาะสม: เหมาะสำหรับลำลองชายหาดบ้านเดทเดินไปตามถนนช้อปปิ้งปาร์ตี้คลับท่องเที่ยว\r\n5. โปรดตรวจสอบแผนภูมิขนาดอย่างละเอียดก่อนซื้อ\r\nแพคเกจรวม:\r\n1 * กางเกงข'),
(38, 'กางเกงขาสั้น ลําลอง แบบเรียบ', 'ลายการ์ตูนน่ารัก แบบเรียบ ใส่นอนได้ สําหรับผู้หญิง', 59, 0x696d616765732f363864323963653661346163645f31332e312e6a7067, '', '0000-00-00', 'shorts', 'เวลาวางตลาด: ฤดูร้อน 2023\r\nชื่อผ้า:ไหมนม\r\nองค์ประกอบผ้าหลัก: เส้นใยโพลีเอสเตอร์ (โพลีเอสเตอร์)\r\nเหมาะสำหรับฤดูกาล: ฤดูร้อน ฤดูหนาว ฤดูใบไม้ผลิ ฤดูใบไม้ร่วง ทุกฤดูกาล\r\nฟังก์ชั่น: ลำลอง, ระบายอากาศ, นอนหลับ, ยืดหยุ่น, บ้าน, เย็น, สบาย, สามารถสวมใส่ภายนอก\r\nหมวดหมู่ฝูงชนที่เกี่ยวข้อง: หญิงสาว\r\nความยาวกา'),
(39, 'กางเกงขากว้างสไตล์เกาหลี', 'กางเกงเอวสูง กางเกงขายาวลำลอง ทรงหลวม', 259, 0x696d616765732f363864323964613863303634345f31342e6a7067, '', '0000-00-00', 'trousers', 'S ยาว 38.6 นิ้ว / สะโพก 40.2 นิ้ว / ความกว้างของขา 9.4 นิ้ว\r\nM ยาว 39.0 นิ้ว / สะโพก 41.7 นิ้ว / ความกว้างของขา 9.8 นิ้ว\r\nL ยาว 39.4 นิ้ว / สะโพก 43.3 นิ้ว / ความกว้างของขา 10.2 นิ้ว\r\nXL ยาว 39.8 นิ้ว / สะโพก 44.9 นิ้ว / ความกว้างของขา 10.6 นิ้ว\r\nXXL ยาว 40.2 นิ้ว / สะโพก 46.5 นิ้ว / ความกว้างของขา '),
(40, 'กางเกงลำลองผู้หญิง เอวสูง', 'กางเกงลำลองผู้หญิง  ลายดอกไม้ เอวยางยืด ทรงหลวม พร้อมส่ง', 279, 0x696d616765732f363864323965643064396164315f31352e6a7067, '', '0000-00-00', 'trousers', 'S ยาว 38.6 นิ้ว เอว 25.2\'\' - 29.9 นิ้ว สะโพก 40.2 นิ้ว\r\nM ยาว 39.0 นิ้ว เอว 26.0\'\' - 31.5 นิ้ว สะโพก 41.7 นิ้ว\r\nL ยาว 39.4 นิ้ว เอว 26.8\'\' - 33.1 นิ้ว สะโพก 43.3 นิ้ว\r\nXL ยาว 39.8 นิ้ว เอว 27.6\'\' - 34.6 นิ้ว สะโพก 44.9 นิ้ว\r\nXXL ยาว 40.2 นิ้ว เอว 28.3\'\' - 36.2 นิ้ว สะโพก 46.5 นิ้ว'),
(41, 'กางเกงขายาวสีดำ Cargo pant', 'กางเกงคาร์โก้เอวยางยืดอเนกประสงค์สไตล์อเมริกัน', 399, 0x696d616765732f363864323966373762376639665f31362e6a7067, '', '0000-00-00', 'trousers', 'หน่วย:(นิ้ว) \r\nS: ความยาว: 38.5\" รอบเอว: 21.2-29.1\" รอบสะโพก: 41.7\" รอบต้นขา: 21.2\"\r\nM: ความยาว: 38.9\" รอบเอว: 22-30.7\" รอบสะโพก: 43.3\" รอบต้นขา: 22\"\r\nL: ความยาว: 39.3\" รอบเอว:22.8-32.3\" รอบสะโพก: 44.9\" รอบต้นขา: 22.8\"\r\nXL: ความยาว:39.7\" รอบเอว: 23.6-33.8\" รอบสะโพก: 46.4\" รอบต้นขา: 23.6\"'),
(42, 'ยีนส์ กางเกงยีนส์ผู้หญิงทรงกระบอก มีกระเป๋าหลายใบ', 'เเบบวินเทจ ดีไซส์พิเศษ กางเกงยีนส์หลายกระเป๋า IF0M', 399, 0x696d616765732f363864326130363764353034365f31372e6a7067, '', '0000-00-00', 'trousers', 'ขนาดและรุ่นสินค้ามีตามภาพ. โปรดอ่านอย่างละเอียด\r\nเนื่องจากการวัดด้วยตนเองอาจมีข้อผิดพลาด 1-2 ซม.'),
(43, 'เสื้อกั๊กกันลมกันน้ำ', 'เหมาะสำหรับการเดินป่าและสวมใส่ได้ทุกเพศ', 475, 0x696d616765732f363864326133346431646538345f362e6a7067, '', '0000-00-00', 'Hoodie', 'คลัง:สินค้าพร้อมส่ง\r\nเพศ: ทั้งสองเพศ\r\nประเภทกีฬา: เบสบอลและซอฟท์บอล\r\nคุณสมบัติของครื่องแต่งกาย: ป้องกันรังสียูวี\r\nส่งจาก: ต่างประเทศ'),
(44, 'ชุดเดรสเท่ห์สำหรับผู้หญิง', 'ชุดลำลองฤดูใบไม้ผลิ/ฤดูร้อน', 279, 0x696d616765732f363864333837336162633336345f31392e312e6a7067, '', '0000-00-00', 'Dress', 'หน่วย:(นิ้ว) \r\nS: ความยาว:31.1 หน้าอก:30.7 เอว:27.5 แขน:7  ไหล่:12.9\r\nM:ความยาว:31.5 หน้าอก:32.3 เอว:29.1 แขน:7.4 ไหล่:13.3\r\nL: ความยาว:31.9 หน้าอก:33.8 เอว:30.7 แขน:7.8 ไหล่:13.7\r\nXL:ความยาว:32.3  หน้าอก:35.4 เอว:32.3 แขน:8.2 ไหล่:14.1'),
(45, 'ชุดเดรสกระโปรงลายจุดคอเหลี่ยม', 'สไตล์ฝรั่งเศสสำหรับผู้หญิงช่วงฤดูร้อน เอวเข้ารูป หวาน เผ็ดร้อน กระโปรงทรงเอ กระโปรงสั้นพองฟู', 359, 0x696d616765732f363864333837626539333430345f32302e6a7067, '', '0000-00-00', 'Dress', 'สีของสินค้าในรูปอาจจะมีความเพี้ยนไปเล็กน้อย จัดส่งสินค้าทุกวัน ตัดรอบประมาณ 16.00-17.00 น'),
(46, 'ชุดเดรสฤดูฤดูใบไม้ผลิ/ฤดูร้อนน่ารัก', 'สีน้ำเงิน สำหรับสุภาพสตรี', 279, 0x696d616765732f363864333838333862323630305f32312e6a7067, '', '0000-00-00', 'Dress', 'ลวดลาย:จิมการ์ม์ \r\nสไตล์:น่ารัก \r\nประเภทเดรส:ระบาย \r\nขนาดใหญ่:ไม่ \r\nวัสดุ:โพลีเอสเตอร์ \r\nองค์ประกอบ:95%โพลีเอสเตอร์+5%อีลาสเทน \r\nประเภทการฟิต:ฟิตแค่พอดี \r\nโปร่งใส:ไม่ \r\nยืดหยุ่น:ไม่ยืดหยุ่น \r\nภูมิภาคที่มาของสินค้า: มณฑลจีน\r\nแพ็คเกจประกอบด้วย'),
(47, 'ชุดเดรสแฟชั่นผู้หญิง', 'ชุดเดรสผ่าท่อนบนของสาวร้อน กระโปรงยาว', 349, 0x696d616765732f363864333861303639313830375f32322e322e6a7067, '', '0000-00-00', 'Dress', 'ระยะเวลาจัดส่ง: สินค้าจะถูกจัดส่งจากบางขุนเทียน กรุงเทพฯ ภายใน 1-2 วันทำการ (ขยายเวลาจัดส่งในวันอาทิตย์และวันหยุดนักขัตฤกษ์)'),
(48, 'สีดำเซ็กซี่เดรสยาวเข้ารูป', 'ดเดรสสไตล์เกาหลีเรียบง่าย กระโปรงสายเดี่ยวทรงเอเปิดไหล่', 499, 0x696d616765732f363864333861633862316464325f32332e6a7067, '', '0000-00-00', 'Dress', '-  เนื่องจากแสงในการถ่ายภาพ จอภาพอาจแตกต่างออกไป อาจแตกต่างจากภาพ โปรดเหนือกว่าในประเภท!\r\n- ขนาดเป็นเพียงสำหรับการอ้างอิง อาจมีข้อผิดพลาดในการวัด 1-3 ซม. โปรดตรวจสอบว่าเหมาะกับขนาดของคุณหรือไม่ก่อนตัดสินใจซื้อ\r\n- คำแนะนำในการเลือกขนาดที่เหมาะสม: ใช้เสื้อผ้าที่คล้ายกันเพื่อเปรียบเทียบกับขนาด'),
(49, 'เดรสยาวสำหรับวันหยุด', 'ลมหวานแขวนคอเชือกแขวนคอชุดยาวพิมพ์ พลัสขนาดเสื้อผ้าผู้หญิง เดรสยาวสำหรับวันหยุด', 279, 0x696d616765732f363864333862363630323262665f32342e6a7067, '', '0000-00-00', 'Dress', 'หน่วย:(นิ้ว) \r\nS: ความยาว:31.1 หน้าอก:30.7 เอว:27.5 แขน:7  ไหล่:12.9\r\nM:ความยาว:31.5 หน้าอก:32.3 เอว:29.1 แขน:7.4 ไหล่:13.3\r\nL: ความยาว:31.9 หน้าอก:33.8 เอว:30.7 แขน:7.8 ไหล่:13.7\r\nXL:ความยาว:32.3  หน้าอก:35.4 เอว:32.3 แขน:8.2 ไหล่:14.1'),
(50, 'ชุดเดรสเปิดไหล่', 'ชุดเดรสเปิดไหล่เซ็กซี่ แขนบาน กระโปรงสไตล์เกาหลี สุดเก๋', 229, 0x696d616765732f363864333862656634366464635f32352e6a7067, '', '0000-00-00', 'Dress', 'หน่วย:(นิ้ว) \r\nS: ความยาว:31.1 หน้าอก:30.7 เอว:27.5 แขน:7  ไหล่:12.9\r\nM:ความยาว:31.5 หน้าอก:32.3 เอว:29.1 แขน:7.4 ไหล่:13.3\r\nL: ความยาว:31.9 หน้าอก:33.8 เอว:30.7 แขน:7.8 ไหล่:13.7\r\nXL:ความยาว:32.3  หน้าอก:35.4 เอว:32.3 แขน:8.2 ไหล่:14.1'),
(51, 'ชุดเดรสแขนสั้นคอปกโปโล', 'สไตล์เกาหลี เหมาะสำหรับการทำงาน', 379, 0x696d616765732f363864333863386236326236665f32362e6a7067, '', '0000-00-00', 'Dress', 'หน่วย:(นิ้ว) \r\nS: ความยาว:31.1 หน้าอก:30.7 เอว:27.5 แขน:7  ไหล่:12.9\r\nM:ความยาว:31.5 หน้าอก:32.3 เอว:29.1 แขน:7.4 ไหล่:13.3\r\nL: ความยาว:31.9 หน้าอก:33.8 เอว:30.7 แขน:7.8 ไหล่:13.7\r\nXL:ความยาว:32.3  หน้าอก:35.4 เอว:32.3 แขน:8.2 ไหล่:14.1'),
(52, 'ชุดเดรสแขนกุดฤดูร้อน', 'กระโปรงแฟชั่นยาวถึงเอวปานกลาง', 199, 0x696d616765732f363864336238303164646338625f32372e6a7067, '', '0000-00-00', 'Dress', 'ความยาวกระโปรง: กระโปรงยาวปานกลาง\r\nองค์ประกอบยอดนิยม: สีทึบ\r\nประเภทแขนเสื้อ: แขนกุด\r\nส่วนประกอบผ้าหลัก: โพลีเอสเตอร์ (เส้นใยโพลีเอสเตอร์) ประเภทสไตล์ข้ามพรมแดน: หวานและสดชื่น'),
(53, 'ชุดนอนผ้าคอตตอน', 'ผ้าฝ้ายผู้หญิง ลายการ์ตูนแขนสั้นขาสั้น', 199, 0x696d616765732f363864336239393163396366345f32382e6a7067, '', '0000-00-00', 'pajamas', 'รายละเอียดสินค้า\r\nฟรีไซส์（สำหรับน้ำหนัก45-60กก)\r\nsize ป้ายติด XXL （ฟรีไซส์）\r\nรอบอก 32-40นิ้ว ยาว 24นิ้ว \r\nรอบเอว 24-38นิ้ว สะโพกไม่เกิน 40นิ้ว ยาว 35 นิ้ว\r\nอ่านก่อนสั่งซื้อนะคะ\r\n-สินค้าในร้านทุกชิ้นส่งจากไทย พร้อมส่ง\r\n-ส่งสินค้า วันจันทร์-เสาร์\r\n-มีบริการ “เก็บเงินปลายทาง'),
(54, 'ชุดนอนแขนขายาว คอปก', 'ชุดนอนเซ็ต ผ้าคอตตอนย่น ใส่สบาย ลายน่ารัก ชุดนอนผู้หญิง', 189, 0x696d616765732f363864336262343364346463365f32392e6a7067, '', '0000-00-00', 'pajamas', 'จัดส่งสินค้าทุกวัน จันทร์-เสาร์\r\nตัดรอบส่ง เวลา 09.00น. หลังจากนั้นส่งวันถัดไป\r\nรบกวนลูกค้าเช็คที่อยู่และเบอร์โทรในระบบให้ถูกต้องก่อนกดสั่งซื้อนะคะ *เพราะบิลปริ้นแปะตามในระบบค่ะ*\r\nเมื่อปริ้นบิลแล้วจะไม่สามารถแก้ไขที่อยู่ได้แล้วนะคะ\r\nพนักงานจะจัดส่งออเดอร์ตามที่ลูกค้ากดสั่งเข้ามาเท่านั้นไม่สามารถเปลี'),
(55, 'ชุดนอนผ้าไหมแขนสั้นขายาว', 'สำหรับผู้ชายและผู้หญิงแบบบาง ผ้าไหมเย็น ขนาดใหญ่ ชุดนอนสบายที่บ้าน', 199, 0x696d616765732f363864336263306661643535395f33302e6a7067, '', '0000-00-00', 'pajamas', 'รายละเอียดสินค้า\r\nโปรดทราบว่า!!!!!!\r\nราคาสําหรับหนึ่งชุดไม่ใช่สองชุด\r\nขนาดผู้ชายและผู้หญิงเหมือนกัน\r\nการส่ง การจัดส่งปกติคือ 3-7 วัน แต่จัดส่งโดย SHOPEE ดังนั้นเราจึงไม่สามารถรับประกันวันจัดส่งที่แน่นอนได้ หวังว่าคุณจะเข้าใจ!'),
(56, 'ชุดนอนกระโปรงแขนยาว ผูกโบว์แขนยาวทรงเจ้าหญิง', 'ชุดนอนกระโปรงแขนยาว ผูกโบว์แขนยาวทรงเจ้าหญิง ชายลูกไม้ใส่สบาย พร้อมส่งจากไทย', 199, 0x696d616765732f363864336263393936613535335f33312e6a7067, '', '0000-00-00', 'pajamas', 'อก 34-40 นิ้ว\r\nเอว 28-30 นิ้ว\r\nสะโพกฟรีไซส์\r\nความยาว 32 นิ้ว\r\n แขนยาว 22 นิ้ว'),
(57, 'เซตชุดนอนเกาหลี', 'ผ้าไหมญี่ปุ่นพรีเมี่ยม แขนสั้น-ขาสั้น สีทึบ ใส่สบาย สไตล์มินิมอล', 159, 0x696d616765732f363864336264353461623532345f33322e6a7067, '', '0000-00-00', 'pajamas', 'SS = รอบอก 44-46 นิ้ว ความยาวเสื้อ 25.5 นิ้ว(รอบอกจริงไม่เกิน43นิ้ว) รอบเอว 22-40 นิ้ว สะโพกจริง 42 นิ้ว ความยาวกางเกง 16 นิ้ว (เหมาะสำหรับน้ำหนัก 40 กิโลไม่เกิน 68 กิโลเท่านั้น)'),
(58, 'ชุดนอนผ้าไหมญี่ปุ่น', 'มีเนื้อผ้านุ่มใสสบาย ลวดลายในการทอทันสมัยสวยงามเรียบเนียน ท่อแบบมีเทกเจอร์ ดูหรูหรา ในราคาเป็นธรรม เป็นชุดนอนแฟชั่นที่กำลังนิยมในโหมดวัยรุ่น และผู้ใหญ่ สีและลวดลายดูมินิมอล เนื้อผ้าไหมญี่ปุ่น ใส่แล้วไม่ระคายเคืองผิว เนื้อผ้าบางเบาใส่สบาย', 229, 0x696d616765732f363864336264646331616234615f33352e6a7067, '', '0000-00-00', 'pajamas', 'ดูหรูหรา ในราคาเป็นธรรม เป็นชุดนอนแฟชั่นที่กำลังนิยมในโหมดวัยรุ่น และผู้ใหญ่ สีและลวดลายดูมินิมอล เนื้อผ้าไหมญี่ปุ่น ใส่แล้วไม่ระคายเคืองผิว เนื้อผ้าบางเบาใส่สบายไม่ร้อน แนะนำให้ลอง');

-- --------------------------------------------------------

--
-- Table structure for table `product_stocks`
--

CREATE TABLE `product_stocks` (
  `variation_id` int(11) NOT NULL,
  `size_name` varchar(50) NOT NULL,
  `stock_quantity` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `product_stocks`
--

INSERT INTO `product_stocks` (`variation_id`, `size_name`, `stock_quantity`) VALUES
(40, 'L', 10),
(40, 'M', 10),
(40, 'S', 10),
(40, 'XL', 10),
(41, 'L', 100),
(41, 'M', 10),
(41, 'S', 10),
(41, 'XL', 10),
(42, 'L', 10),
(42, 'M', 10),
(42, 'S', 10),
(42, 'XL', 10),
(51, 'L', 10),
(51, 'M', 10),
(51, 'S', 10),
(51, 'XL', 10),
(52, 'L', 10),
(52, 'M', 10),
(52, 'S', 10),
(52, 'XL', 10),
(53, 'L', 10),
(53, 'M', 10),
(53, 'S', 10),
(53, 'XL', 10),
(129, 'S', 2),
(129, 'XS', 2),
(130, 'XS', 10),
(193, 'L', 10),
(193, 'M', 10),
(193, 'S', 10),
(193, 'XL', 10),
(194, 'L', 10),
(194, 'M', 10),
(194, 'S', 10),
(194, 'XL', 10),
(195, 'L', 10),
(195, 'M', 10),
(195, 'S', 10),
(195, 'XL', 10),
(196, 'L', 10),
(196, 'M', 10),
(196, 'S', 10),
(196, 'XL', 10),
(197, 'M', 10),
(197, 'S', 10),
(197, 'XS', 10),
(198, 'L', 10),
(198, 'M', 10),
(198, 'S', 10),
(198, 'XL', 10),
(199, '2XL', 10),
(199, 'L', 10),
(199, 'M', 10),
(199, 'S', 10),
(199, 'XL', 10),
(200, 'L', 10),
(200, 'M', 10),
(200, 'S', 10),
(200, 'XL', 10),
(201, 'L', 10),
(201, 'M', 10),
(201, 'S', 10),
(201, 'XL', 10),
(202, '2XL', 30),
(203, '2XL', 25),
(204, '2XL', 25),
(205, '2XL', 25),
(206, '2XL', 25),
(207, '2XL', 30),
(208, '2XL', 20),
(209, '2XL', 20),
(210, '2XL', 10),
(211, '2XL', 20),
(212, '2XL', 15),
(213, '2XL', 20),
(214, 'L', 10),
(214, 'M', 10),
(214, 'S', 10),
(215, 'L', 10),
(215, 'M', 10),
(215, 'S', 10),
(215, 'XL', 10),
(216, 'M', 10),
(216, 'S', 10),
(217, 'M', 10),
(217, 'S', 10),
(218, 'M', 10),
(218, 'S', 10),
(219, 'M', 10),
(219, 'S', 10),
(220, 'L', 10),
(220, 'M', 10),
(220, 'S', 10),
(221, 'L', 10),
(221, 'M', 10),
(221, 'S', 10),
(222, 'L', 10),
(222, 'M', 10),
(222, 'S', 10),
(222, 'XL', 10),
(223, 'L', 10),
(223, 'M', 10),
(223, 'S', 10),
(223, 'XL', 10),
(224, 'L', 10),
(224, 'M', 10),
(224, 'S', 10),
(224, 'XL', 10),
(225, 'M', 10),
(225, 'S', 10),
(225, 'XS', 10),
(226, 'M', 10),
(226, 'S', 10),
(226, 'XS', 10),
(227, 'L', 10),
(227, 'M', 10),
(227, 'S', 10),
(227, 'XS', 10),
(228, 'M', 10),
(228, 'S', 10),
(228, 'XS', 10),
(229, 'M', 10),
(229, 'S', 10),
(229, 'XS', 10),
(230, 'L', 10),
(230, 'M', 10),
(230, 'S', 10),
(230, 'XL', 10),
(231, 'L', 10),
(231, 'M', 10),
(231, 'S', 10),
(231, 'XL', 10),
(232, 'L', 10),
(232, 'M', 10),
(232, 'S', 10),
(232, 'XL', 10),
(233, '2XL', 10),
(233, 'L', 10),
(233, 'M', 10),
(233, 'S', 10),
(233, 'XL', 10),
(234, '2XL', 10),
(234, 'L', 10),
(234, 'M', 10),
(234, 'S', 10),
(234, 'XL', 10),
(235, '2XL', 10),
(235, 'L', 10),
(235, 'M', 10),
(235, 'S', 10),
(235, 'XL', 10),
(236, 'L', 10),
(236, 'M', 10),
(236, 'S', 10),
(236, 'XL', 10),
(237, 'L', 10),
(237, 'M', 10),
(237, 'S', 10),
(237, 'XL', 10),
(238, 'L', 10),
(238, 'M', 10),
(238, 'S', 10),
(238, 'XL', 10),
(239, '2XL', 10),
(239, 'L', 10),
(239, 'M', 10),
(239, 'S', 10),
(239, 'XL', 10),
(240, '2XL', 10),
(240, 'L', 10),
(240, 'M', 10),
(240, 'S', 10),
(240, 'XL', 10),
(241, '2XL', 10),
(241, 'L', 10),
(241, 'M', 10),
(241, 'S', 10),
(241, 'XL', 10),
(242, '2XL', 10),
(242, 'L', 10),
(242, 'M', 10),
(242, 'S', 10),
(242, 'XL', 10),
(243, '2XL', 10),
(243, 'L', 10),
(243, 'M', 10),
(243, 'S', 10),
(243, 'XL', 10),
(244, '2XL', 10),
(244, 'L', 10),
(244, 'M', 10),
(244, 'S', 10),
(244, 'XL', 10),
(245, '2XL', 10),
(245, 'L', 10),
(245, 'M', 10),
(245, 'S', 10),
(245, 'XL', 10),
(246, '2XL', 10),
(246, 'L', 10),
(246, 'M', 10),
(246, 'XL', 10),
(247, '2XL', 10),
(247, 'L', 10),
(247, 'M', 10),
(247, 'XL', 10),
(248, '2XL', 10),
(248, 'L', 10),
(248, 'M', 10),
(248, 'XL', 10),
(249, 'L', 10),
(249, 'M', 10),
(249, 'S', 10),
(249, 'XS', 10),
(250, 'L', 10),
(250, 'M', 10),
(250, 'S', 10),
(250, 'XS', 10),
(251, 'L', 10),
(251, 'M', 10),
(251, 'S', 10),
(251, 'XL', 10),
(252, 'L', 10),
(252, 'M', 10),
(252, 'S', 10),
(252, 'XL', 10),
(253, 'L', 10),
(253, 'M', 10),
(253, 'S', 10),
(253, 'XS', 10),
(254, 'L', 10),
(254, 'M', 10),
(254, 'S', 10),
(254, 'XS', 10),
(255, 'M', 10),
(255, 'S', 10),
(256, 'M', 10),
(256, 'S', 10),
(257, 'S', 10),
(257, 'XS', 10),
(258, 'S', 10),
(258, 'XS', 10),
(259, 'S', 10),
(259, 'XS', 10),
(260, 'S', 10),
(260, 'XS', 10),
(261, '2XL', 10),
(261, 'L', 10),
(261, 'M', 10),
(261, 'S', 10),
(261, 'XL', 10),
(262, '2XL', 10),
(262, 'L', 10),
(262, 'M', 10),
(262, 'S', 10),
(262, 'XL', 10),
(263, 'L', 10),
(263, 'M', 10),
(263, 'S', 10),
(263, 'XS', 10),
(264, 'L', 10),
(264, 'M', 10),
(264, 'S', 10),
(264, 'XS', 10),
(265, 'L', 10),
(265, 'M', 10),
(265, 'S', 10),
(265, 'XS', 10),
(266, 'L', 10),
(266, 'M', 10),
(266, 'S', 10),
(266, 'XL', 10),
(267, 'L', 10),
(267, 'M', 10),
(267, 'S', 10),
(267, 'XL', 10),
(268, '2XL', 10),
(268, 'L', 10),
(268, 'M', 10),
(268, 'XL', 10),
(269, '2XL', 10),
(269, 'L', 10),
(269, 'M', 10),
(269, 'XL', 10),
(270, '2XL', 10),
(270, 'L', 0),
(270, 'M', 0),
(270, 'XL', 0),
(271, '2XL', 0),
(271, 'L', 0),
(271, 'M', 0),
(271, 'XL', 10),
(272, '2XL', 0),
(272, 'L', 10),
(272, 'M', 10),
(272, 'XL', 10),
(273, '2XL', 10),
(273, 'L', 10),
(273, 'M', 10),
(273, 'XL', 10),
(274, '2XL', 10),
(274, 'L', 10),
(274, 'M', 10),
(274, 'XL', 10),
(275, '2XL', 10),
(275, 'L', 10),
(275, 'M', 10),
(275, 'XL', 10);

-- --------------------------------------------------------

--
-- Table structure for table `product_variations`
--

CREATE TABLE `product_variations` (
  `variation_id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `color_name` varchar(50) NOT NULL,
  `size_name` varchar(50) NOT NULL,
  `image_url` varchar(300) NOT NULL,
  `stock` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `product_variations`
--

INSERT INTO `product_variations` (`variation_id`, `product_id`, `color_name`, `size_name`, `image_url`, `stock`) VALUES
(1, 8, 'น้ำตาล', 'L', 'images/68ccc79fa1e86_68c17d8b2608a-1 (1).jpg', 50),
(2, 15, 'ดำ', 'L', 'images/68ccc79fa2512_68c7c07522140-1.2.jpg', 45),
(3, 16, 'แดง', 'S', 'images/68ccc84f48723_68c41cecc928b-68c39bc3dcdb0-2.3.jpg', 80),
(4, 13, 'เทา', 'S', 'images/68ccc79fa1e86_68c17d8b2608a-1 (1).jpg', 30),
(5, 9, 'เทา', 'L', 'images/68ccc79fa1e86_68c17d8b2608a-1 (1).jpg', 25),
(6, 9, 'ดำ', 'M', 'images/68ccc79fa2512_68c7c07522140-1.2.jpg', 60),
(7, 12, 'ดำ', 'XL', 'images/68ccc79fa2512_68c7c07522140-1.2.jpg', 20),
(8, 11, 'ขาว', 'S', 'images/68ccc79fa2512_68c7c07522140-1.2.jpg', 40),
(9, 11, 'ดำ', 'M', 'images/68ccc79fa2512_68c7c07522140-1.2.jpg', 60),
(20, 22, 'เทา', '', 'images/68ce7a24db55e_68c17d8b2608a-1 (1).jpg', 10),
(21, 22, 'กรม', '', 'images/68ce7a24db8a6_68c17c55e8bba-1.1.jpg', 7),
(22, 22, 'ดำ', '', 'images/68ce7a24dbbe6_68c7c07522140-1.2.jpg', 3),
(23, 22, 'น้ำตาล', '', 'images/68ce7a24dbfc0_1.3.jpg', 5),
(24, 23, 'ยีนส์ฟอก', '', 'images/68cfb85320d17_18.jpg', 0),
(25, 24, 'ฟ้า', '', 'images/68cfcbdb35126_21.jpg', 0),
(26, 25, 'ฟ้า', '', 'images/68cfcc546c61d_21.jpg', 0),
(40, 30, 'เบส', '', '', 0),
(41, 30, 'ดำ', '', 'images/68d295246b726_6.1.jpg', 0),
(42, 30, 'ส้ม', '', 'images/68d295246c367_6.2.jpg', 0),
(51, 34, 'เบส', '', '', 0),
(52, 34, 'ดำ', '', 'images/68d299cfc9564_6.1.jpg', 0),
(53, 34, 'ส้ม', '', 'images/68d299cfc9f5d_6.2.jpg', 0),
(129, 59, 'ahk', '', 'images/68d7aaef2c9a2_33.jpg', 0),
(130, 60, 'ฟ้า', '', 'images/68d7abc089b24_33.jpg', 0),
(193, 51, 'น้ำตาล', '', 'images/68d38c8b63cc9_26.jpg', 0),
(194, 51, 'ดำ', '', 'images/68d38c8b65762_26.1.jpg', 0),
(195, 50, 'ครีม', '', 'images/68d38bef4778f_25.1.jpg', 0),
(196, 50, 'ดำ', '', 'images/68d38bef49904_25.2.jpg', 0),
(197, 44, 'ชมพู', '', 'images/68d3873abd77f_19.jpg', 0),
(198, 49, 'ครีม', '', 'images/68d38b66031b6_24.1.jpg', 0),
(199, 49, 'ครีม', '', 'images/68d38b660595b_24.2.jpg', 0),
(200, 52, 'ขาว', '', 'images/68d3b801de74f_27.1.jpg', 0),
(201, 52, 'ขาว', '', 'images/68d3b801e0719_27.2.jpg', 0),
(202, 53, 'ดำ', '', 'images/68d3b991cab1e_28.jpg', 0),
(203, 53, 'ครีมลายเป็ด', '', 'images/68d3b991cbedf_28.1.jpg', 0),
(204, 53, 'ครีมลายสติซ', '', 'images/68d3b991cdd8b_28.2.jpg', 0),
(205, 53, 'ลายหมีพู', '', 'images/68d3b991cef19_28.3.jpg', 0),
(206, 54, 'ครีมลายดอกไม้', '', 'images/68d3bb43d5cff_29.jpg', 0),
(207, 54, 'ลายหมีคิตตี้', '', 'images/68d3bb43d79b3_29.1.jpg', 0),
(208, 54, 'ฟ้าลายดอก', '', 'images/68d3bb43d8c7e_29.2.jpg', 0),
(209, 54, 'ชมพูอ่อนลายแมว', '', 'images/68d3bb43d9ad0_29.3.jpg', 0),
(210, 55, 'น้ำเงิน', '', 'images/68d3bc0fae181_30.jpg', 0),
(211, 55, 'แดง', '', 'images/68d3bc0faf761_30.1.jpg', 0),
(212, 55, 'เทา', '', 'images/68d3bc0fb0cae_30.2.jpg', 0),
(213, 55, 'ชมพู', '', 'images/68d3bc0fb19d5_30.3.jpg', 0),
(214, 56, 'ครีม', '', 'images/68d3bc996b420_31.1.jpg', 0),
(215, 56, 'ขาว', '', 'images/68d3bc996d977_31.2.jpg', 0),
(216, 57, 'มิ้น', '', 'images/68d3bd54ac1f6_32.jpg', 0),
(217, 57, 'ฟ้า', '', 'images/68d3bd54ae89b_32.1.jpg', 0),
(218, 57, 'เหลือง', '', 'images/68d3bd54b0532_32.2.jpg', 0),
(219, 57, 'ชมพู', '', 'images/68d3bd54b1a14_32.3.jpg', 0),
(220, 58, 'ขาว', '', 'images/68d3bddc1b6be_35.1.jpg', 0),
(221, 58, 'ดำ', '', 'images/68d3bddc1d391_35.2.jpg', 0),
(222, 48, 'เบส', '', 'images/68d38ac8b2b31_23.jpg', 0),
(223, 48, 'ดำ', '', 'images/68d38ac8b506b_23.1.jpg', 0),
(224, 48, 'เทา', '', 'images/68d38ac8b7938_23.2.jpg', 0),
(225, 47, 'ขาว', '', 'images/68d38a06926bd_22.1.jpg', 0),
(226, 47, 'ดำ', '', 'images/68d38a0694ece_22.jpg', 0),
(227, 46, 'ฟ้า', '', 'images/68d38838b304f_21.1.jpg', 0),
(228, 45, 'ครีม', '', 'images/68d387be94353_20.jpg', 0),
(229, 45, 'ขาว', '', 'images/68d387be96364_20.1.jpg', 0),
(230, 43, 'เบส', '', 'images/68d2a34d1e464_6.jpg', 0),
(231, 43, 'ดำ', '', 'images/68d2a34d1f10a_6.1.jpg', 0),
(232, 43, 'ส้ม', '', 'images/68d2a34d1fd6a_6.2.jpg', 0),
(233, 42, 'ยีนส์เข้ม', '', 'images/68d2a067d5610_17.jpg', 0),
(234, 42, 'ยีนส์อ่อน', '', 'images/68d2a067d63ae_17.1.jpg', 0),
(235, 42, 'ยีนส์ดำ', '', 'images/68d2a067d7635_17.2.jpg', 0),
(236, 41, 'ดำ', '', 'images/68d29f77b866b_16.1.jpg', 0),
(237, 41, 'แดง', '', 'images/68d29f77b92fa_16.2.jpg', 0),
(238, 41, 'เทา', '', 'images/68d29f77b9ea9_16.3.jpg', 0),
(239, 40, 'ขาว', '', 'images/68d29ed0da0e3_15.jpg', 0),
(240, 40, 'ชมพู', '', 'images/68d29ed0db2af_15.1.jpg', 0),
(241, 40, 'ฟ้า', '', 'images/68d29ed0dc0c7_15.2.jpg', 0),
(242, 40, 'มิ้น', '', 'images/68d29ed0dcf13_15.3.jpg', 0),
(243, 39, 'ดำ', '', 'images/68d29da8c0d6c_14.jpg', 0),
(244, 39, 'เทา', '', 'images/68d29da8c19cb_14.1.jpg', 0),
(245, 39, 'ขาว', '', 'images/68d29da8c24d2_14.2.jpg', 0),
(246, 38, 'ฟ้าอ่อน', '', 'images/68d29ce6a5083_13.jpg', 0),
(247, 38, 'ขาว', '', 'images/68d29ce6a5d76_13.1.jpg', 0),
(248, 38, 'ฟ้า', '', 'images/68d29ce6a6a41_13.2.jpg', 0),
(249, 37, 'ขาว', '', 'images/68d29c4ad8e50_12.1.jpg', 0),
(250, 37, 'ดำ', '', 'images/68d29c4ad9b41_10.2.jpg', 0),
(251, 36, 'ยีนส์เข้ม', '', 'images/68d29bc8b873e_11.1.jpg', 0),
(252, 36, 'ยีนส์ฟอก', '', 'images/68d29bc8b9142_11.3.jpg', 0),
(253, 35, 'ขาว', '', 'images/68d29b2244dac_10.1.jpg', 0),
(254, 35, 'ดำ', '', 'images/68d29b2245743_10.2.jpg', 0),
(255, 33, 'ขาว', '', 'images/68d2988a39f0b_9.jpg', 0),
(256, 33, 'น้ำตาล', '', 'images/68d2988a3ace4_9.1.jpg', 0),
(257, 32, 'ขาว', '', 'images/68d297f75a794_8.jpg', 0),
(258, 32, 'ฟ้า', '', 'images/68d297f75afe4_8.1.jpg', 0),
(259, 32, 'ดำ', '', 'images/68d297f75b688_8.2.jpg', 0),
(260, 32, 'ชมพู', '', 'images/68d297f75bcfd_8.3.jpg', 0),
(261, 31, 'ฟ้าอ่อน', '', 'images/68d29619bc04b_7.jpg', 0),
(262, 31, 'เหลืองอ่อน', '', 'images/68d29619bd017_7.1.jpg', 0),
(263, 29, 'ชมพู', '', 'images/68d293735606f_4.jpg', 0),
(264, 29, 'ดำ', '', 'images/68d29373570c5_4.1.jpg', 0),
(265, 29, 'ขาว', '', 'images/68d2937357eac_4.2.jpg', 0),
(266, 28, 'ขาว', '', 'images/68d29276b79ae_3.jpg', 0),
(267, 28, 'ฟ้า', '', 'images/68d29276b8f98_3.1.jpg', 0),
(268, 27, 'ดำ', '', 'images/68d2814a28318_2.1.jpg', 0),
(269, 27, 'ขาว', '', 'images/68d2814a29318_2.2.jpg', 0),
(270, 27, 'แดง', '', 'images/68d2814a29f36_2.3.jpg', 0),
(271, 27, 'เขียว', '', 'images/68d2814a2ab0c_2.jpg', 0),
(272, 26, 'เทา', '', 'images/68d2802cb67bf_1 (1).jpg', 0),
(273, 26, 'กรม', '', 'images/68d2802cb7716_1.1.jpg', 0),
(274, 26, 'ดำ', '', 'images/68d2802cb817b_1.2.jpg', 0),
(275, 26, 'น้ำตาล', '', 'images/68d2802cb8cbc_1.3.jpg', 0);

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `full_name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `phone_number` varchar(20) NOT NULL,
  `shipping_address` text NOT NULL,
  `registered_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `password`, `full_name`, `email`, `phone_number`, `shipping_address`, `registered_at`) VALUES
(1, 'ทอฝัน', '$2y$10$FXCJ8mE5fPTntCdkxlYGCeM./.RdxMHmGPbBUzazlbSmIP.O5YZb6', 'ทอฝัน', '66010916036@gmail.com', '0999999999', 'มหาสารคาม', '2025-09-15 14:25:16'),
(2, 'ใบหม่อน', '$2y$10$NaEpcM/ViX4cx0yKUTG7rO20jjbIMrHJLUX/YBTloUDSdnXZHY7t.', 'ใบหม่อน', '66010916040@gmail.com', '0888888888', 'มหาสารคาม', '2025-09-15 14:27:21'),
(6, 'rinny', '$2y$10$pWcx3z1aZr9MxdFKgHBY.OiWYqRdXRen5vmLOXOsiHDsrYgGN4aD6', 'รินนี่', '66010916037@gmail.com', '0777777777', 'มหาสารคาม', '2025-09-15 11:41:23'),
(7, 'โอปอล์', '$2y$10$qp.Mx9tej/QEVC.e5CPsvO00ZV/8pNPvBLknnj2wOOZWZHHljC9hS', 'โอปอล์', '66010916018@gmail.com', '0666666666', 'มหาสารคาม', '2025-09-15 11:50:36');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`categories_id`);

--
-- Indexes for table `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`orders_id`);

--
-- Indexes for table `order_items`
--
ALTER TABLE `order_items`
  ADD PRIMARY KEY (`order_items_id`);

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`product_id`);

--
-- Indexes for table `product_stocks`
--
ALTER TABLE `product_stocks`
  ADD PRIMARY KEY (`variation_id`,`size_name`);

--
-- Indexes for table `product_variations`
--
ALTER TABLE `product_variations`
  ADD PRIMARY KEY (`variation_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `categories_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `orders`
--
ALTER TABLE `orders`
  MODIFY `orders_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `order_items`
--
ALTER TABLE `order_items`
  MODIFY `order_items_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `product_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=62;

--
-- AUTO_INCREMENT for table `product_variations`
--
ALTER TABLE `product_variations`
  MODIFY `variation_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=276;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `product_stocks`
--
ALTER TABLE `product_stocks`
  ADD CONSTRAINT `fk_variation_id` FOREIGN KEY (`variation_id`) REFERENCES `product_variations` (`variation_id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
